It does appear the API is ignoring the request to change public network access enabled:
```
------- Stdout: -------
=== RUN   TestAccMySqlFlexibleServer_publicNetworkAccessDisabled
=== PAUSE TestAccMySqlFlexibleServer_publicNetworkAccessDisabled
=== CONT  TestAccMySqlFlexibleServer_publicNetworkAccessDisabled
    testcase.go:130: Step 1/3 error: After applying this test step, the non-refresh plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement
        
        Terraform will perform the following actions:
        
          # azurerm_mysql_flexible_server.test must be replaced
        -/+ resource "azurerm_mysql_flexible_server" "test" {
              ~ fqdn                          = "acctest-fs-240821194320628889.mysql.database.azure.com" -> (known after apply)
              ~ id                            = "/subscriptions/*******/resourceGroups/acctestRG-mysql-240821194320628889/providers/Microsoft.DBforMySQL/flexibleServers/acctest-fs-240821194320628889" -> (known after apply)
                name                          = "acctest-fs-240821194320628889"
              ~ public_network_access_enabled = true -> false # forces replacement
              ~ replica_capacity              = 10 -> (known after apply)
              ~ replication_role              = "None" -> (known after apply)
              ~ version                       = "5.7" -> (known after apply)
                # (8 unchanged attributes hidden)
        
              - storage {
                  - auto_grow_enabled  = true -> null
                  - io_scaling_enabled = false -> null
                  - iops               = 360 -> null
                  - size_gb            = 20 -> null
                }
        
                # (1 unchanged block hidden)
            }
        
        Plan: 1 to add, 0 to change, 1 to destroy.
--- FAIL: TestAccMySqlFlexibleServer_publicNetworkAccessDisabled (525.81s)
FAIL
```
as such at this time i am going to close my PR and wait for the API to be fixed